Enums/фин_РежимыИнтеграцииСУчетнойСистемой.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>фин_РежимыИнтеграцииСУчетнойСистемой</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БухгалтерияДляКазахстана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Самостоятельный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомплексноеУправлениеФинансамиИБюджетированиеДляКазахстана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БухгалтерияДляКазахстана_3_0</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УправлениеТорговлейДляКазахстана_3</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОсновноеСредство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НематериальныйАктив</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/фин_ПлановаяНоменклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>фин_ПлановаяНоменклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПлановаяЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_ЕдиницыИзмеренияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ) Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПозицииВПланеЗакупок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакВнеоборотногоАктива</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.фин_ЕдиницыИзмеренияНоменклатуры</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/узп_УправлениеЗакупкамиКлиент/Ext/Module.bsl
//////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДБОРА НОМЕНКЛАТУРЫ

//процедура вызова формы подбора номенклатуры из обработки подбора БК
//
Процедура ПодборНоменклатуры(ЭтаФорма,УникальныйИдентификатор,Таблица, ОтборПоВидуНоменклатуры = Истина) Экспорт
	ПараметрыПодбора = ПолучитьПараметрыПодбора(Таблица, ЭтаФорма.Объект);
	Если ПараметрыПодбора <> Неопределено Тогда
		//ОткрытьФорму("Обработка.ПодборНоменклатуры.Форма.ОсновнаяФорма", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	КонецЕсли;
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыборка",Истина);
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе",Ложь);
	Если ОтборПоВидуНоменклатуры Тогда
		ПараметрыФормы.Вставить("Отбор",Новый Структура("Услуга",ПараметрыПодбора.Услуги));
	КонецЕсли;
	РежимВстраивания = фин_ОбщегоНазначенияВызовСервераПовтИсп.ЗначениеПеременной("фин_РежимИнтеграцииСУчетнойСистемой");
	Если РежимВстраивания = ПредопределенноеЗначение("Перечисление.фин_РежимыИнтеграцииСУчетнойСистемой.КомплексноеУправлениеФинансамиИБюджетированиеДляКазахстана") Тогда
		ФормаПодбора = ПолучитьФорму("Справочник.Номенклатура.Форма.УправляемаяФормаВыбора",ПараметрыФормы,ЭтаФорма.Элементы[Таблица]);
		ФормаПодбора.Открыть();
	Иначе
		Попытка
	        ОткрытьФорму(ИмяФормыВыбора("Справочник.Номенклатура"),ПараметрыФормы,ЭтаФорма.Элементы[Таблица],,ВариантОткрытияОкна.ОтдельноеОкно);    
	    Исключение
	        ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить управляемую форму подбора!");
	    КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Функция ИмяФормыВыбора(ИмяТипа)
    Возврат фин_ОбщегоНазначенияВызовСервераПовтИсп.ИмяФормыВыбораСправочника(ИмяТипа);
КонецФункции

//Процедура начала подбора номенклатуры из справочника Номенклатур
Процедура НачалоПодбораНоменклатуры(Элемент,ПлановаяНоменклатура,Услуги,УникальныйИдентификатор,Подбор=Ложь,Форма = Неопределено, ПрефиксТаблицы = "", ОтборПоВидуНоменклатуры = Истина) Экспорт
	Если Не Подбор Тогда
		мПараметры = Новый Структура;
		Если ОтборПоВидуНоменклатуры Тогда
			мПараметры.Вставить("Отбор",Новый Структура("Услуга", Услуги));
		КонецЕсли;
		мПараметры.Вставить("ЗакрыватьПриВыборе",Ложь);
		ФормаНоменклатура = ПолучитьФорму("Справочник."+?(ПлановаяНоменклатура=Истина,"фин_Плановая","")+"Номенклатура.ФормаВыбора",мПараметры,Элемент,УникальныйИдентификатор);
		Если ТипЗнч(ФормаНоменклатура)<>Тип("УправляемаяФорма") Тогда
			ФормаНоменклатура.Отбор.Услуга.Значение = Услуги;
			ФормаНоменклатура.Отбор.Услуга.Использование = Истина;
		КонецЕсли;
		ФормаНоменклатура.Открыть();	
	Иначе
		ИмяТаблицы = ?(Услуги,ПрефиксТаблицы+"Услуги",ПрефиксТаблицы+"Товары");
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Заголовок"               , "");
		ПараметрыФормы.Вставить("ИмяТаблицы"              , ИмяТаблицы);
		ПараметрыФормы.Вставить("Товар"                   , ИмяТаблицы = ПрефиксТаблицы+"Товары");
		ПараметрыФормы.Вставить("Услуги"                  , ИмяТаблицы = ПрефиксТаблицы+"Услуги");
		Если ОтборПоВидуНоменклатуры Тогда
			ПараметрыФормы.Вставить("Отбор", Новый Структура("Услуга",Услуги));
		КонецЕсли;
		ОткрытьФорму("Справочник.фин_ПлановаяНоменклатура.Форма.ФормаПодбора", ПараметрыФормы, Форма, УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

// Осуществляет выбор номенклатуры из справочников Номенклатура и ПлановаяНоменклатура
//
Процедура НоменклатураНачалоВыбора(ЭтаФорма, Элемент, СтандартнаяОбработка, Услуга = Неопределено,ТекущаяНоменклатура) Экспорт
	ТипыВвода = Элемент.ОграничениеТипа.Типы();
	Если ТипыВвода.Количество()>1 Тогда
		СтандартнаяОбработка = Ложь;
		СписокВыбора = Новый СписокЗначений;
		СписокВыбора.ЗагрузитьЗначения(ТипыВвода);		
		ПараметрыФормы = Новый Структура("Элемент, ДанныеВыбора, СтандартнаяОбработка, ТекущаяНоменклатура",Элемент,,,ТекущаяНоменклатура);
		Если Услуга <> Неопределено Тогда
			ПараметрыФормы.Вставить("Услуги", Услуга);
		КонецЕсли;
		Оп = Новый ОписаниеОповещения("ВыборНоменклатуры", ЭтотОбъект, ПараметрыФормы);
		ЭтаФорма.ПоказатьВыборИзСписка(Оп, СписокВыбора, Элемент);
	ИначеЕсли ТипыВвода.Количество() = 1 Тогда
		СтандартнаяОбработка = Ложь;
		ПараметрыФормы = Новый Структура("Элемент, ДанныеВыбора, СтандартнаяОбработка, ТекущаяНоменклатура",Элемент,,,ТекущаяНоменклатура);
		Если Услуга <> Неопределено Тогда
			ПараметрыФормы.Вставить("Услуги", Услуга);
		КонецЕсли;
		//ВыборНоменклатуры(Новый Структура("Значение",ТипЗнч(ТекущаяНоменклатура)), ПараметрыФормы)
		//ВыборНоменклатуры(Новый Структура("Значение",ТипЗнч(ТипыВвода[0])), ПараметрыФормы)
		ВыборНоменклатуры(Новый Структура("Значение",ТипыВвода[0]), ПараметрыФормы)
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьПараметрыПодбора(ИмяТаблицы,Объект)
    
	ДатаРасчетов		 = ?(НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДата()), Неопределено, Объект.Дата);
	
	ЗаголовокПодбора	 = НСтр("ru = 'Подбор номенклатуры в %1 (%2)'");
	ПредставлениеТаблицы = НСтр("ru = '" + ИмяТаблицы + "'");
	
	ЗаголовокПодбора     = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ЗаголовокПодбора, Объект.Ссылка, ПредставлениеТаблицы);
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Организация"             , ?(Объект.Свойство("Организация"),Объект.Организация,ПредопределенноеЗначение("Справочник.Организации.ПустаяСсылка")));
	ПараметрыФормы.Вставить("СтруктурноеПодразделение", ?(Объект.Свойство("СтруктурноеПодразделение"),Объект.СтруктурноеПодразделение,ПредопределенноеЗначение("Справочник.ПодразделенияОрганизаций.ПустаяСсылка")));
	Если Объект.Свойство("Склад") Тогда
		ПараметрыФормы.Вставить("Склад"                   , Объект.Склад);
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Заголовок"               , ЗаголовокПодбора);
	ПараметрыФормы.Вставить("ИмяТаблицы"              , ИмяТаблицы);
	ПараметрыФормы.Вставить("Товар"                   , ИмяТаблицы = "Товары" или ИмяТаблицы = "ТаблицаТовары");
	ПараметрыФормы.Вставить("Услуги"                  , ИмяТаблицы = "Услуги" или ИмяТаблицы = "ТаблицаУслуги");
	ПараметрыФормы.Вставить("ВыбиратьВсе"             , Истина);	
	
	СписокЗапросов = Новый СписокЗначений();
	СписокЗапросов.Добавить("ПоСправочнику", "По справочнику");
	Если ИмяТаблицы = "Товары" Тогда
		СписокЗапросов.Добавить("ОстаткиНоменклатуры", "Остатки номенклатуры");
	КонецЕсли;
	
	ПараметрыФормы.Вставить("СписокВидовПодбора", СписокЗапросов);
	ПараметрыФормы.Вставить("ОбъектСсылка"      , Объект.Ссылка);
	
	Возврат ПараметрыФормы;

КонецФункции

//Процедура, указанная в описании оповещения
//
Процедура ВыборНоменклатуры(ТипВвода, Параметры) Экспорт
	Если ТипВвода = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Элемент = Параметры.Элемент;
	Если Параметры.Свойство("Услуги") Тогда
		Услуги = Параметры.Услуги;
	КонецЕсли;
	ТекущаяНоменклатура = Параметры.ТекущаяНоменклатура;
	
	Если ТипВвода.Значение = Тип("СправочникСсылка.фин_ПлановаяНоменклатура") Тогда
		мПараметры = Новый Структура;
		Если Параметры.Свойство("Услуги") Тогда
			мПараметры.Вставить("Отбор",Новый Структура("ТипПозицииВПланеЗакупок", ?(Услуги,ПредопределенноеЗначение("Перечисление.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.Услуга"),СписокТиповНоменклатуры())));
		КонецЕсли;
		мПараметры.Вставить("ЗакрыватьПриВыборе",Истина);
		мПараметры.Вставить("ТекущаяСтрока",ТекущаяНоменклатура);
		ФормаНоменклатура = ПолучитьФорму("Справочник.фин_ПлановаяНоменклатура.ФормаВыбора",мПараметры,Элемент);
		ФормаНоменклатура.Открыть();
	ИначеЕсли ТипВвода.Значение = Тип("СправочникСсылка.Номенклатура") Тогда
	//Иначе
		мПараметры = Новый Структура;
		Если Параметры.Свойство("Услуги") Тогда
			мПараметры.Вставить("Отбор",Новый Структура("Услуга", Услуги));
		КонецЕсли;
		мПараметры.Вставить("ЗакрыватьПриВыборе",Истина);
		мПараметры.Вставить("ТекущаяСтрока",ТекущаяНоменклатура);
		ФормаНоменклатура = ПолучитьФорму("Справочник.Номенклатура.ФормаВыбора",мПараметры,Элемент);
		Если ТипЗнч(ФормаНоменклатура)<>Тип("УправляемаяФорма") 
			И Параметры.Свойство("Услуги") Тогда
			ФормаНоменклатура.Отбор.Услуга.Установить(Услуги);
		КонецЕсли;
		ФормаНоменклатура.Открыть();
	КонецЕсли;
КонецПроцедуры

Функция СписокТиповНоменклатуры()
	Список = Новый СписокЗначений;
	Список.Добавить(ПредопределенноеЗначение("Перечисление.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.Товар"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.НематериальныйАктив"));
	Список.Добавить(ПредопределенноеЗначение("Перечисление.узп_ТипыПозицийПлановойНоменклатурыВПланеЗакупок.ОсновноеСредство"));
	Возврат Список;
КонецФункции
